Revit 2026 API

# IIFCImporterServer Methods

---

The IIFCImporterServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | ImportIFC | The method that Revit will invoke to perform an import from IFC. |

#### Reference

IIFCImporterServer Interface

Autodesk.Revit.DB.IFC Namespace